cask_args appdir: "/Applications"
tap "homebrew/core"
tap "homebrew/bundle"
tap "caskroom/cask"
tap "caskroom/versions"
brew "awscli"
brew "azure-cli"
brew "cmake"
brew "reattach-to-user-namespace"
brew "n" # node version management
brew "grip" # for vim-markdown-preview
brew "stow"
brew "ansible"
brew "packer"
brew "terraform"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "watchman"
brew "z"
brew "zsh"
cask "1password"
cask "firefoxdeveloperedition"
cask "docker"
cask "postman"
cask "slack-beta"
cask "sqlpro-studio"
cask "studio-3t"
cask "virtualbox"
cask "vagrant"
mas "Magnet", id: 441258766
